#### TrussMemberType Enumeration

---

|  |
| --- |
| See Also |

Indicates the "kind" of a truss member.

**Namespace:**   Autodesk.Revit.DB.Structure
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public enum TrussMemberType ``` |

| Visual Basic |
| --- |
| ``` Public Enumeration TrussMemberType ``` |

| Visual C++ |
| --- |
| ``` public enum class TrussMemberType ``` |

# Members

| Member name | Description |
| --- | --- |
| ETK\_Unknown | Unknown element type. |
| ETK\_TrussTopChord | Truss top chord. |
| ETK\_TrussBottomChord | Truss bottom chord. |
| ETK\_TrussVertWeb | Truss VertWeb. |
| ETK\_TrussDiagWeb | Truss DiagWeb. |

# See Also

Autodesk.Revit.DB.Structure Namespace